// ********************************* Задание_1 ********************************************
// const job1 = [1, 5, 4, 10, 0, 3];

// for (let i = 0; i < job1.length; i++) {
//     if (job1[i] == 10) break;
//     console.log(job1[i]);    
// }

// ********************************* Задание_2 ********************************************
// let arr = [1, 5, 4, 10, 0, 3];
// let res = arr.indexOf(10);

// console.log(res);
// ********************************* Задание_3 ********************************************
// const job = [1, 3, 5, 10, 20];
// const str = job.join(' ');
// console.log(str);

// ********************************* Задание_4 ********************************************
// let job = [
//     [1, 1, 1], 
//     [1, 1, 1], 
//     [1, 1, 1]
// ];

// console.log(job [0] [0]);
// console.log(job [0] [1]);
// console.log(job [0] [2]);
// ********************************* Задание_5 ********************************************
// const job = [1, 1, 1];
// job[3] = 2;
// job[4] = 2;
// job[5] = 2;

// console.log(job);
// ********************************* Задание_6 ********************************************
// let job = [9, 8, 7, 'a', 6, 5];
// let arr = job.sort();
// console.log(job.pop());
// console.log(job);

// ********************************* Задание_7 ********************************************
let array = [9, 8, 7, 6, 5];
(array[0]);
// let messege = prompt('Угадайте один из циклов массива')

//  if ((array[0]) || (array(1))) {
//  	alert('Угадал');
//  } else {
//  	alert ('Сори... неправильно')
//  }

// ********************************* Задание_8 ********************************************
// ********************************* Задание_9 ********************************************
// ********************************* Задание_10 ********************************************
// ********************************* Задание_11 ********************************************
// ********************************* Задание_12 ********************************************
// ********************************* Задание_13 ********************************************
// ********************************* Задание_14 ********************************************
// ********************************* Задание_15 ********************************************



// ******************************************************************************************

// let product = ['Кресло', 'Стул', 'Стол'];
// console.log(product);

// let product = ['Кресло', 'Стул', 'Стол'];
// console.log(product.length);

// let product = ['Кресло', 'Стул', 'Стол'];
// console.log(product[0]);
// console.log(product[1]);
// console.log(product[2]);

// let product = ['Кресло', 'Стул', 'Стол'];
// console.log(product);
// product[0] = 'Комод';
// console.log(product);
// product[3] = 'Диван';
// console.log(product);

// let numbers = [1, 2, 3, 4];
// console.log(numbers);
// numbers[3] = 4;
// numbers[4] = 5;
// console.log(numbers);
// numbers = 6;
// console.log(numbers);

// const userName = ['Alex', 'Dima', 'Vlad'];
// console.log(userName);
// userName[userName.length] = 'Bob';
// console.log(userName);
// userName = 'Jim';

// const numbs = [2, 4, 5, 6, 8];
// for (let i = 0; i < numbs.length; i++) {
//     console.log(numbs[i]);
    
// }
