// ********************************* Задание_1 ********************************************
// Напишите функцию, которая возвращает меньшее из 2 чисел. Например, 
// из двух чисел — 8 и 4 — функция должна вернуть 4. Если передадим 6 и 6, 
// то функция должна вернуть 6.

// let a = 8;
// let b = 4;
// let min = Math.min(a, b);
// console.log(min);

function minValue() {
    let a = 8;
    let b = 4;
    Math.min(a, b);
}

// function minValue(a, b) {
//     let a = 8;
//     let b = 4;

//     if (a < b) {
//             console.log(a);
//     } else if (b < a) {
//             console.log(b);
//     } else if (a = b) {
//             console.log(a);
//     }
// }

// function calc(a, b) {
//     return (a < b || b < a);   
// }

// let result = min(8, 4);

// console.log(`Максимальное число ${result}`);


// ********************************* Задание_2 ********************************************
// ********************************* Задание_3 ********************************************
// ********************************* Задание_4 ********************************************
// ********************************* Задание_5 ********************************************
// ********************************* Задание_6 ********************************************
// ********************************* Задание_7 ********************************************