// ********************************* Задание_1 ********************************************
// const job1 = [1, 5, 4, 10, 0, 3];

// for (let i = 0; i < job1.length; i++) {
//     if (job1[i] == 10) break;
//     console.log(job1[i]);    
// }

// ********************************* Задание_2 ********************************************
const job2 = [1, 5, 4, 10, 0, 3];


// job2.forEach((el, index) => {
//     console.log(`${index}:${el}`);
// });


// for (let item of job2) {
//     console.log(item);
// }

// const quest = job2.indexOf(4);
// console.log(quest);

// ********************************* Задание_3 ********************************************
// ********************************* Задание_4 ********************************************
// ********************************* Задание_5 ********************************************
// ********************************* Задание_6 ********************************************
// ********************************* Задание_7 ********************************************
// ********************************* Задание_8 ********************************************
// ********************************* Задание_9 ********************************************
// ********************************* Задание_10 ********************************************
// ********************************* Задание_11 ********************************************
// ********************************* Задание_12 ********************************************
// ********************************* Задание_13 ********************************************
// ********************************* Задание_14 ********************************************
// ********************************* Задание_15 ********************************************



// ******************************************************************************************

// let product = ['Кресло', 'Стул', 'Стол'];
// console.log(product);

// let product = ['Кресло', 'Стул', 'Стол'];
// console.log(product.length);

// let product = ['Кресло', 'Стул', 'Стол'];
// console.log(product[0]);
// console.log(product[1]);
// console.log(product[2]);

// let product = ['Кресло', 'Стул', 'Стол'];
// console.log(product);
// product[0] = 'Комод';
// console.log(product);
// product[3] = 'Диван';
// console.log(product);

// let numbers = [1, 2, 3, 4];
// console.log(numbers);
// numbers[3] = 4;
// numbers[4] = 5;
// console.log(numbers);
// numbers = 6;
// console.log(numbers);

// const userName = ['Alex', 'Dima', 'Vlad'];
// console.log(userName);
// userName[userName.length] = 'Bob';
// console.log(userName);
// userName = 'Jim';

// const numbs = [2, 4, 5, 6, 8];
// for (let i = 0; i < numbs.length; i++) {
//     console.log(numbs[i]);
    
// }
